import random
VOWELS = ("а", "ъ", "о", "у", "е", "и")

def count_srichki(word):
    counter = 0
    for char in word:
        for vowel in VOWELS:
            if char == vowel:
                counter += 1
                break
    return counter

def generate_haiku_lines(corpus):
    line_counter = 1
    srichka_counter = 0
    line = ""
    while True:
        num_srichki = 7 if line_counter == 2 else 5
        _, value = random.choice(list(corpus.items()))
        word = value[random.randint(0, len(value) - 1)]

        if srichka_counter + count_srichki(word) < num_srichki:
            line = line + word + " "
            srichka_counter += count_srichki(word)
        elif srichka_counter + count_srichki(word) == num_srichki:
            line += word
            yield line
            line_counter += 1
            if line_counter == 3:
                line_counter = 0
            srichka_counter = 0
            line = ""


corpus = {'първата': ['ми'], 'ми': ['работа', 'двайсет'], 'работа': ['беше'], 'беше': ['да', 'страшен'], 'да': ['вдигна', 'бъда', 'не', 'не', 'легализирам', 'го', 'напишеш'], 'вдигна': ['бензина'], 'бензина': ['с'], 'с': ['лев', 'тия', 'тая'], 'т': ['за'], 'за': ['мене', 'мен,', 'гласа,', 'това', 'всичко', 'всичко'], 'мене': ['беше'], 'страшен': ['кеф'], 'от': ['тоя'], 'тоя': ['лев', 'чичко'], 'лев': ['седемдесет'], 'седемдесет': ['стотинки'], 'стотинки': ['са'], 'са': ['за'], 'мен,': ['а'], 'а': ['трийсете'], 'трийсете': ['ги'], 'ги': ['нося'], 'нося': ['лично'], 'лично': ['на', 'депутата', 'депутата'], 'на': ['асен', 'дългия,', 'дебелия', 'двамата'], 'знам,': ['няма'], 'няма': ['как'], 'как': ['да', 'успя'], 'бъда': ['кратъки'], 'кратъки': ['да'], 'не': ['спомена', 'те', 'наяде'], 'спомена': ['нещо'], 'нещо': ['мило'], 'мило': ['за'], 'гласа,': ['който'], 'който': ['лекува'], 'лекува': ['запек'], 'чува': ['се'], 'се': ['десислава'], 'десислава': ['атанасова'], 'атанасова': ['шефке,'], 'шефке,': ['мно'], 'мно': ['ме'], 'ме': ['кефиш'], 'кефиш': ['с'], 'тия': ['твоите'], 'твоите': ['цайси', 'хора'], 'заклевам': ['се,'], 'се,': ['при', 'ма', 'ето'], 'при': ['други'], 'други': ['обстоятелства'], 'обстоятелства': ['сеш'], 'сеш': ['се'], 'копейка,': ['к'], 'к': ['е'], 'е': ['твоята', 'вкусен', 'една', 'да', 'виновен', 'виновен'], 'твоята': ['прогноза'], 'хора': ['ще'], 'ще': ['си', 'си', 'ти'], 'си': ['праснат', 'траем,'], 'праснат': ['ли'], 'ли': ['четвърта', 'е', 'се', 'се,'], 'четвърта': ['доза'], 'догодина': ['обещавам'], 'обещавам': [
    'да'], 'те': ['тормозя'], 'дай': ['ми'], 'двайсет': ['гласа'], 'гласа': ['да'], 'легализирам': ['коза'], 'траем,': ['красива'], 'красива': ['резиденция,'], 'резиденция,': ['знаем,'], 'знаем,': ['обичам'], 'обичам': ['възрожденци'], 'възрожденци': ['под'], 'под': ['наем'], 'последно,': ['кажи'], 'кажи': ['честно,', 'честно'], 'честно,': ['мон'], 'мон': ['амур,'], 'амур,': ['толко'], 'толко': ['ли'], 'вкусен': ['този'], 'този': ['руски'], 'руски': ['шнур'], 'ей,': ['бройлер,'], 'бройлер,': ['ще'], 'ти': ['купя', 'помогна,'], 'купя': ['бойлер'], 'нека': ['ти', 'сам'], 'помогна,': ['стига'], 'стига': ['с'], 'тая': ['мизерия'], 'това': ['е', 'нека'], 'една': ['мистерия'], 'мистерия': ['как'], 'успя': ['да'], 'го': ['поемеш', 'тоя', 'вече'], 'поемеш': ['целия'], 'целия': ['едновременно'], 'едновременно': ['и'], 'и': ['на', 'на', 'нищо'], 'дългия,': ['и'], 'моята': ['лесна,'], 'лесна,': ['има'], 'има': ['аерогара'], 'трудното': ['е'], 'напишеш': ['коментара'], 'сам': ['изям'], 'изям': ['кафявата'], 'кафявата': ['попара'], 'попара': ['в'], 'в': ['държавата'], 'държавата': ['на'], 'двамата': ['шопара'], 'виж': ['кво,', 'кво,'], 'кво,': ['според', 'според'], 'според': ['мен', 'мен'], 'мен': ['за', 'за'], 'всичко': ['е', 'е'], 'виновен': ['лично', 'лично'], 'депутата': ['христо', 'христо'], 'честно': ['побърка'], 'побърка': ['ли'], 'батко': ['не'], 'наяде': ['се,'], 'ма': ['поне'], 'поне': ['наспа'], 'наспа': ['ли'], 'ето': ['продаде'], 'продаде': ['се'], 'мани': ['го'], 'ей': ['го'], 'вече': ['8'], '8': ['месеца'], 'месеца': ['и']}
haiku_writer = generate_haiku_lines(corpus)
for i in range(1, 10):
    print(next(haiku_writer))
    if i % 3 == 0:
        print('\n')  # За визуално разграничаване
